// Напишите программу вычисления функции: x = f(a)

Console.WriteLine("Hello, World!");
